tap "armand-sauzay/tap"
tap "browsh-org/browsh"
tap "ngrok/ngrok"
brew "atuin"
brew "bash"
brew "chezmoi"
brew "coreutils"
brew "fastfetch"
brew "fish"
brew "glow"
brew "gnu-sed"
brew "grep"
brew "ipython"
brew "lazygit"
brew "lsd"
brew "neovim"
brew "node"
brew "ripgrep"
brew "tree"
brew "zsh-autocomplete"
cask "ngrok"
vscode "4orter.notion-theme--dark"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bierner.docs-view"
vscode "blueglassblock.better-json5"
vscode "charliermarsh.ruff"
vscode "ckolkman.vscode-postgres"
vscode "danibram.ghibli-inspired-theme"
vscode "detachhead.basedpyright"
vscode "docker.docker"
vscode "docsmsft.docs-yaml"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "elanandkumar.el-vsc-product-icon-theme"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "ghiblistuff.ghibli-theme"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "heyitschun.ghibli-syntax-themes"
vscode "huge.solarized-hello"
vscode "jaredkent.laserwave"
vscode "jiapeiyao.tab-group"
vscode "johnpapa.winteriscoming"
vscode "katjanakosic.vscode-json5"
vscode "loilo.snazzy-light"
vscode "luisfontes19.vscode-swissknife"
vscode "lumiknit.parchment"
vscode "mads-hartmann.bash-ide-vscode"
vscode "makuke1234.monokai-dimmed-light"
vscode "mgwg.light-pink-theme"
vscode "mhutchie.git-graph"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "rebornix.toggle"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "savh.json5-kit"
vscode "shakram02.bash-beautify"
vscode "shaneliesegang.vscode-simple-icons-rev"
vscode "skellock.just"
vscode "solomonkinard.git-blame"
vscode "suadelabs.suade-report-template-tools"
vscode "tamasfe.even-better-toml"
vscode "tekumara.typos-vscode"
vscode "tudoudou.json5-for-vscode"
vscode "usernamehw.errorlens"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "webfreak.cute-theme"
vscode "webrender.synthwave-x-fluoromachine"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
go "github.com/lmriccardo/conventional-commits-cli"
